Repository: Abhishekgupta204/Workbench
Catalog: po/*.po
Languages: cs

source: Learn and prototype with GNOME technologies
cs: Učte se a prototypujte s technologiemi GNOME

source: Workbench goal is to let you experiment with GNOME technologies, no matter if tinkering for the first time or building and testing a custom GTK widget.
cs: Cíl aplikace Workbench je pomoci vám experimentovat s technologiemi GNOME, aniž by záleželo na tom, zda se s nimi setkáváte poprvé, nebo zda vytváříte a testujete vlastní GTK widget.

source: Among other things, Workbench comes with
cs: Mimo jiné Workbench nabízí

source: realtime GTK/CSS preview
cs: náhled GTK/CSS v reálném čase

source: JavaScript for quick and easy scripting
cs: JavaScript pro rychlé a jednoduché psaní scriptů

source: Syntax highlighting, undo/redo, autosave
cs: Zvýrazňování syntaxe, funkce zpět/znovu, automatické ukládání

source: code formatter
cs: formátování kódu

source: console logs
cs: vypisování do konzole

source: library of examples
cs: knihovna příkladů

source: Side by side editors with live preview on the right and console in the bottom
cs: Vedle sebe umístěné editory s živým náhledem vpravo a konzolí dole

source: Add a Library of examples
cs: Přidána knihovna příkladů

source: Add an example of WebSocket client
cs: Přidán příklad WebSocketového klienta

source: Add an example of toasts
cs: Přidán příklad toast zpráv

source: Add an example of application window
cs: Přidán příklad okna aplikace

source: Add an example of desktop notification
cs: Přidán příklad oznámení na ploše

source: Add Adwaita Demo, GTK Demo, GTK Widget Factory and GTK Icon Browser
cs: Přidáno demo Adwaity a GTK, GTK Widget Factory a prohlížeč ikon GTK

source: The Console can be collapsed by resizing it
cs: Konzoli lze zavřít změnou její velikosti

source: Prevent system.exit from quitting Workbench
cs: Zabráněno system.exit při ukončování Workbench

source: Allow calling GObject.registerClass multiple times
cs: Povoleno volání GObject.registerClass vícekrát

source: Prevent crash caused by using non GtkBuildable objects
cs: Zabráněno pádům kvůli objektům, které nejsou GtkBuildable

source: Allow using DBus and Gio.Application
cs: Povoleno použití DBus a Gio.Application

source: Allow using network
cs: Povoleno použití sítě

source: Enable GtkWindow objects preview
cs: Povolen náhled pro objekty GtkWindow

source: Take a png screenshot of the preview
cs: Možnost pořídit png snímek náhledu

source: The console is now resizable
cs: Velikost konzole lze nyní upravit

source: Redesign the dark/light mode switcher
cs: Nový design přepínače tmavého/světlého režimu

source: Show platform and dependencies in about dialog
cs: Zobrazení platformy a závislostí v dialogu o aplikaci

source: Update to GNOME platform 42
cs: Aktualizováno na platformu GNOME 42

source: Various fixes
cs: Různé opravy

source: This is the first release of Workbench. We hope you like it.
cs: Toto je první vydání aplikace Workbench. Doufáme, že se vám líbí.

source: Learn and prototype with GNOME technologies
cs: Učte se a prototypujte s technologiemi GNOME

source: translator-credits
cs: Vojtěch Perník <translations@pervoj.cz>

source: Run
cs: Spustit

source: Inspector
cs: Inspektor

source: Open Console
cs: Otevřít konzoli

source: Clear Console
cs: Vyčistit konzoli

source: Keyboard Shortcuts
cs: Klávesové zkratky

source: Quit
cs: Ukončit

source: Are you sure you want to discard your changes?
cs: Vážně chcete zahodit změny?

source: Library
cs: Knihovna

source: Open Library of Demos and Examples (Ctrl+Shift+O)
cs: Otevřít knihovnu ukázek a příkladů (Ctrl+Shift+O)

source: Run (Ctrl+⏎)
cs: Spustit (Ctrl+⏎)

source: Code
cs: Kód

source: Style
cs: Styl

source: Preview
cs: Náhled

source: Use Light mode
cs: Použít světlý režim

source: Use Dark mode
cs: Použít tmavý režim

source: Bookmarks
cs: Záložky

source: Code - JavaScript
cs: Kód - JavaScript

source: Style - CSS
cs: Styl - CSS

source: Take Screenshot of Preview
cs: Pořídit snímek náhledu

source: Console
cs: Konzole

source: Show logs (Ctrl+Shift+K)
cs: Zobrazit logy (Ctrl+Shift+K)

source: Open GTK Inspector (Ctrl+Shift+I)
cs: Otevřít Inspektor GTK (Ctrl+Shift+I)

source: Clear
cs: Vyčistit

source: Clear console (Ctrl+K)
cs: Vyčistit konzoli (Ctrl+K)

source: Examples to start from or get inspired by
cs: Příklady, se kterými můžete začít, nebo se jen nechat inspirovat

source: Windowed Preview
cs: Náhled v okně

source: This interface can only be previewed as a separate window. We recommend using "Always on Top"
cs: Tomuto rozhraní může být vytvořen náhled pouze v samostatném okně. Doporučujeme použít „Vždy nahoře“

source: Open File…
cs: Otevřít soubor…

source: Platform Tools
cs: Nástroje platformy

source: Adwaita Demo
cs: Ukázka Adwaity

source: GTK Demo
cs: Ukázka GTK

source: GTK Icon Browser
cs: Prohlížeč ikon GTK

source: About Workbench
cs: O aplikaci Workbench

source: Learn
cs: Učit se

source: Human Interface Guidelines (HIG)
cs: Pokyny pro lidské rozhraní (HIG)

source: UI components
cs: Komponenty UI

source: Platform components
cs: Komponenty platformy

source: Get help
cs: Získat pomoc
